VDowbensky/Panchip/WHXY/SPL/IdeSupport/EWARM/arm/config/debugger/WHXY/CW32W031.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GTIM1">
      <name>GTIM2</name>
      <description>desc GTIM2</description>
      <baseAddress>0x40001000</baseAddress>
      <interrupt>
        <name>GTIM2</name>
        <description>General Timer2 Interrupt</description>
        <value>17</value>
      </interrupt>
    </peripheral>    
    <peripheral>
      <name>I2C1</name>
      <description>desc I2C1</description>
      <baseAddress>0x40005400</baseAddress>
      <interrupt>
        <name>I2C1</name>
        <description>I2C1 Interrupt</description>
        <value>23</value>
      </interrupt>
      <groupName>I2C</groupName>
      <headerStructName>I2C</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BRREN</name>
          <description>desc BRREN</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <description>desc BRR</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BRR</name>
              <description>desc BRR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>desc CR</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STA</name>
              <description>desc STA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STO</name>
              <description>desc STO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SI</name>
              <description>desc SI</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AA</name>
              <description>desc AA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT</name>
              <description>desc FLT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>desc DR</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DR</name>
              <description>desc DR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>desc STAT</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STAT</name>
              <description>desc STAT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR0</name>
          <description>desc ADDR0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR0</name>
              <description>desc ADDR0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GC</name>
              <description>desc GC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR1</name>
          <description>desc ADDR1</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR1</name>
              <description>desc ADDR1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR2</name>
          <description>desc ADDR2</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR2</name>
              <description>desc ADDR2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MATCH</name>
          <description>desc MATCH</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDR2</name>
              <description>desc ADDR2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDR1</name>
              <description>desc ADDR1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDR0</name>
              <description>desc ADDR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
